[
  "Yes, I'm cheering for Zuckerberg in an MMA fight",
  "Google MeatGPT and thank me later",
  "Oh you like concurrency? name all the threads",
  "2nd best thing: Ts enums, 1st is everything else",
  "Can't trust someone who use a light theme",
  "Real programmers have a fibonacci posture",
  "Camels are the new unicorns",
  "Serverless? oh, it's more like server deez nuts",
  "Precommit hooks are a poor form of governance",
  "Learning how to program in Java might kill you",
  "Clean code sucks",
  "Crystal? why devs naming langs after strippers?",
  "Can we agree that js is for crazy people?",
  "Udemy is mid at best",
  "CloudFlare is just a fancy 404 page generator",
  "The real web3 was the money we wasted along the way",
  "Your Docker container is just a fancy chroot jail",
  "Microservices are just monoliths with extra failure points",
  "Python devs can't decide if whitespace matters or not",
  "CSS is a programming language, fight me IRL",
  "Every Rust tutorial should start with a therapy session",
  "Your Kubernetes cluster is over-engineered AF",
  "SQL is NoSQL's daddy issues",
  "TypeScript is just JavaScript with a superiority complex",
  "Git blame is my daily horoscope",
  "Agile is just waterfall but we pretend to care",
  "The best IDE is still Notepad++, everything else is bloat",
  "PHP isn't dead, it's just living its best zombie life",
  "AI won't take your job, but that junior dev who knows Rust might",
  "Your blockchain solution is just Excel with more steps",
  "React is just jQuery with a PhD",
  "Vim users are the vegans of programming",
  "AWS pricing is basically financial BDSM",
  "Ruby on Rails? More like Ruby on Life Support",
  "Your architecture diagram is just corporate fanfiction",
  "Machine learning? You mean spicy statistics?",
  "DNS issues aren't tech problems, they're cosmic punishment",
  "Your startup is just a CRUD app in a trench coat",
  "GraphQL is REST with commitment issues",
  "Electron apps are why your RAM filed for divorce",
  "YAML is just indentation with a god complex",
  "Linux users have Stockholm syndrome with their terminals",
  "Scrum is medieval torture rebranded for tech bros",
  "The metaverse is just Minecraft for people with money",
  "Python: where indentation is more important than your life choices",
  "JavaScript: the language that makes you say 'it works on my machine' a lot",
  "Java: verbose as a politician's speech",
  "C++: the language that compiles your nightmares",
  "Rust: borrow checker knows best, even when you don't",
  "React: virtual DOM, real headaches",
  "Angular: dependency injection, or just dependency addiction?",
  "Vue: simple, until you need to scale",
  "Django: ORM so good, you forget SQL exists",
  "Flask: minimalism until you need an admin panel",
  "Agile: iterative failure",
  "Scrum: stand-ups that stand for nothing",
  "Waterfall: plan your way to obsolescence",
  "Git: merge conflicts, the silent killers of productivity",
  "Docker: containerization, or just virtualization in drag?",
  "Kubernetes: the complexity you didn't know you needed",
  "AI: when math gets a marketing department",
  "Machine learning: overfitting, the silent epidemic",
  "Blockchain: solving problems that don't exist with technology that's overkill",
  "Cloud computing: rent, don't own",
  "Work-life balance: a fairy tale for non-devs",
  "Remote work: where 'working from home' means 'working all the time'",
  "Open source: contribute or GTFO",
  "Technical debt: interest rates are killer",
  "Code reviews: where your code is judged, jury, and executed",
  "Debugging: the detective work no one signed up for",
  "Testing: the safety net you hope you never need, but always do",
  "Documentation: read me, or regret it later",
  "Pair programming: two brains, one keyboard, infinite arguments",
  "Legacy code: the software equivalent of an archaeological site"
]
